ErpTest/src/AccumulationRegisters/МатериалыИРаботыВПроизводстве/МатериалыИРаботыВПроизводстве.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>МатериалыИРаботыВПроизводстве</name>
  <comment>Материалы и работы в производстве</comment>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>СтатьяКалькуляции</name>
    <type>
      <types>CatalogRef.СтатьиКалькуляции</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказНаПроизводство</name>
    <type>
      <types>DocumentRef.СписаниеЗатратНаВыпуск</types>
      <types>DocumentRef.ЗаказНаПроизводство</types>
      <types>DocumentRef.ЗаказПереработчику</types>
      <types>DocumentRef.ВыпускПродукции</types>
      <types>DocumentRef.ПоступлениеОтПереработчика</types>
    </type>
  </attributes>
  <attributes>
    <name>КодСтрокиПродукция</name>
    <comment>Номер строки в документе &quot;Выпуск продукции&quot;</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Этап</name>
    <type>
      <types>CatalogRef.ЭтапыПроизводства</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРегистратора</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>НалогообложениеНДС</name>
    <type>
      <types>EnumRef.ТипыНалогообложенияНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>АналитикаУчетаПродукции</name>
    <type>
      <types>CatalogRef.КлючиАналитикиУчетаНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>Спецификация</name>
    <type>
      <types>CatalogRef.РесурсныеСпецификации</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяРасходов</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
      <types>ChartOfCharacteristicTypesRef.СтатьиАктивовПассивов</types>
    </type>
  </attributes>
  <attributes>
    <name>АналитикаРасходов</name>
    <type>
      <types>Characteristic.СтатьиРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>НаправлениеДеятельности</name>
    <type>
      <types>CatalogRef.НаправленияДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеПолучатель</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Первичное</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>АналитикаУчетаНоменклатуры</name>
    <type>
      <types>CatalogRef.КлючиАналитикиУчетаНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>РасчетПартий</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>БазаРаспределения</name>
    <type>
      <types>EnumRef.ТипыБазыРаспределенияРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>АналитикаАктивовПассивов</name>
    <type>
      <types>Characteristic.СтатьиАктивовПассивов</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторСтроки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РасчетНеЗавершен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
      <types>CatalogRef.Партнеры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Серия</name>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Назначение</name>
    <type>
      <types>CatalogRef.Назначения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УдалитьАналитикаУчетаНоменклатуры</name>
    <type>
      <types>CatalogRef.КлючиАналитикиУчетаНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

ErpTest/src/Enums/ТипыОперацийВводаОстатков/ТипыОперацийВводаОстатков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыОперацийВводаОстатков</name>
  <enumValues>
    <name>ОстаткиВАвтономныхКассахККМКОформлениюОтчетовОРозничныхПродажах</name>
  </enumValues>
  <enumValues>
    <name>ОстаткиВАвтономныхКассахККМПоРозничнойВыручке</name>
  </enumValues>
  <enumValues>
    <name>ОстаткиВКассах</name>
  </enumValues>
  <enumValues>
    <name>ОстаткиЗадолженностиКлиентов</name>
  </enumValues>
  <enumValues>
    <name>ОстаткиЗадолженностиПередПоставщиками</name>
  </enumValues>
  <enumValues>
    <name>ОстаткиЗадолженностиПодотчетников</name>
  </enumValues>
  <enumValues>
    <name>ОстаткиНаБанковскихСчетах</name>
  </enumValues>
  <enumValues>
    <name>ОстаткиПоАвансамКлиентов</name>
  </enumValues>
  <enumValues>
    <name>ОстаткиПоАвансамПоставщикам</name>
  </enumValues>
  <enumValues>
    <name>ОстаткиРасчетовМеждуОрганизациямиПоАвансам</name>
  </enumValues>
  <enumValues>
    <name>ОстаткиРасчетовМеждуОрганизациямиПоРеализациям</name>
  </enumValues>
  <enumValues>
    <name>ОстаткиСобственныхТоваров</name>
  </enumValues>
  <enumValues>
    <name>ОстаткиТоваровПереданныхНаКомиссию</name>
  </enumValues>
  <enumValues>
    <name>ОстаткиТоваровПолученныхНаКомиссию</name>
  </enumValues>
  <enumValues>
    <name>ПерерасходыПодотчетныхСредств</name>
  </enumValues>
  <enumValues>
    <name>ДенежныеСредстваКПоступлениюОтЭквайера</name>
  </enumValues>
  <enumValues>
    <name>ОстаткиВозвратнойТарыПереданнойКлиентам</name>
  </enumValues>
  <enumValues>
    <name>ОстаткиВозвратнойТарыПринятойОтПоставщиков</name>
  </enumValues>
  <enumValues>
    <name>ПереходНаИспользованиеАдресногоХраненияОстатков</name>
  </enumValues>
  <enumValues>
    <name>ПереходНаИспользованиеСкладскихПомещений</name>
  </enumValues>
  <enumValues>
    <name>ОстаткиПрочихАктивовПассивов</name>
  </enumValues>
  <enumValues>
    <name>ПодарочныеСертификаты</name>
  </enumValues>
  <enumValues>
    <name>ОстаткиОС</name>
  </enumValues>
  <enumValues>
    <name>ОстаткиНМА</name>
  </enumValues>
  <enumValues>
    <name>ОстаткиПоДоговорамКредитовИДепозитов</name>
  </enumValues>
  <enumValues>
    <name>ОстаткиТМЦВЭксплуатации</name>
  </enumValues>
  <enumValues>
    <name>ОстаткиМатериаловПереданныхПереработчикам</name>
  </enumValues>
  <enumValues>
    <name>ОстаткиМатериаловПереданныхВПроизводство</name>
  </enumValues>
  <enumValues>
    <name>ОстаткиПрочихРасходов</name>
  </enumValues>
  <enumValues>
    <name>ФинансовыйРезультатЗаПрошлыеПериоды</name>
  </enumValues>
  <enumValues>
    <name>ОптовыеПродажиЗаПрошлыеПериоды</name>
  </enumValues>
  <enumValues>
    <name>РозничныеПродажиЗаПрошлыеПериоды</name>
  </enumValues>
  <enumValues>
    <name>ОстаткиАрендованныхОС</name>
  </enumValues>
  <enumValues>
    <name>ОстаткиПредметовЛизингаНаБалансе</name>
  </enumValues>
  <enumValues>
    <name>ОстаткиПредметовЛизингаЗаБалансом</name>
  </enumValues>
  <enumValues>
    <name>ОстаткиВзаиморасчетовПоДоговорамЛизинга</name>
  </enumValues>
  <enumValues>
    <name>ОстаткиПереданныхВАрендуОС</name>
  </enumValues>
  <enumValues>
    <name>ОстаткиПереданныхВАрендуПредметовЛизингаНаБалансе</name>
  </enumValues>
  <enumValues>
    <name>ОстаткиНДСПоПриобретеннымЦенностям</name>
  </enumValues>
  <enumValues>
    <name>ОстаткиПрочихРасходовУСН</name>
  </enumValues>
  <enumValues>
    <name>ОстаткиРасходовУСНПоМатериалам</name>
  </enumValues>
  <enumValues>
    <name>ОстаткиРасходовУСНПоТоварам</name>
  </enumValues>
</mdclass:Enum>

ErpTest/src/Enums/ТипыНоменклатуры/ТипыНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыНоменклатуры</name>
  <enumValues>
    <name>Товар</name>
  </enumValues>
  <enumValues>
    <name>МногооборотнаяТара</name>
  </enumValues>
  <enumValues>
    <name>Услуга</name>
  </enumValues>
  <enumValues>
    <name>Работа</name>
  </enumValues>
  <enumValues>
    <name>Набор</name>
  </enumValues>
</mdclass:Enum>

ErpTest/src/AccumulationRegisters/МатериалыИРаботыВПроизводстве/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ОбновлениеИнформационнойБазы

Процедура ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	ПолноеИмяРегистра = "РегистрНакопления.МатериалыИРаботыВПроизводстве";
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр(
		"ДатаПереходаНаПартионныйУчетВерсии22",
		УниверсальныеМеханизмыПартийИСебестоимостиПовтИсп.ДатаПереходаНаПартионныйУчетВерсии22());
	Запрос.УстановитьПараметр(
		"ПартионныйУчетВерсии22",
		УниверсальныеМеханизмыПартийИСебестоимостиПовтИсп.ПартионныйУчетВерсии22(НачалоМесяца(ТекущаяДатаСеанса())));
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВводОстатков.Ссылка КАК Регистратор
	|ИЗ
	|	Документ.ВводОстатков КАК ВводОстатков
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВводОстатков.Товары КАК ВводОстатковТовары
	|		ПО ВводОстатков.Ссылка = ВводОстатковТовары.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.МатериалыИРаботыВПроизводстве КАК МатериалыИРаботыВПроизводстве
	|		ПО ВводОстатков.Ссылка = МатериалыИРаботыВПроизводстве.Регистратор
	|			И (ВводОстатковТовары.Номенклатура = МатериалыИРаботыВПроизводстве.Номенклатура)
	|ГДЕ
	|	ВводОстатков.ТипОперации = ЗНАЧЕНИЕ(Перечисление.ТипыОперацийВводаОстатков.ОстаткиМатериаловПереданныхПереработчикам)
	|	И ВводОстатков.ОтражатьВОперативномУчете
	|	И ВводОстатковТовары.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара)
	|	И МатериалыИРаботыВПроизводстве.Регистратор ЕСТЬ NULL
	//++ НЕ УТ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	// Очистка КодСтрокиПродукция для отчетов переработчика не по заказу
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Движения.Регистратор КАК Регистратор
	|ИЗ
	|	РегистрНакопления.МатериалыИРаботыВПроизводстве КАК Движения
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОтчетПереработчика КАК ОтчетПереработчика
	|		ПО ОтчетПереработчика.Ссылка = Движения.Регистратор
	|ГДЕ
	|	Движения.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	И НЕ Движения.КодСтрокиПродукция = 0
	|	И НЕ ОтчетПереработчика.ПоЗаказам
	|	И Движения.Период < &ДатаПереходаНаПартионныйУчетВерсии22
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	// Удаление всех движений товаров по переработке при ПУ 2.2
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Движения.Регистратор КАК Регистратор
	|ИЗ
	|	РегистрНакопления.МатериалыИРаботыВПроизводстве КАК Движения
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
	|	ПО СпрНоменклатура.Ссылка = Движения.Номенклатура
	|	
	|ГДЕ
	|	&ПартионныйУчетВерсии22
	|	И Движения.Период >= &ДатаПереходаНаПартионныйУчетВерсии22
	|	И ТИПЗНАЧЕНИЯ(Движения.Регистратор) В (ТИП(Документ.ПередачаСырьяПереработчику),
	|											ТИП(Документ.ВозвратСырьяОтПереработчика),
	|											ТИП(Документ.ПоступлениеОтПереработчика),
	|											ТИП(Документ.ОтчетПереработчика))
	|	И СпрНоменклатура.ТипНоменклатуры В (ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар),
	|										ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара))
	//-- НЕ УТ
	|";
	
	ОбновлениеИнформационнойБазы.ОтметитьРегистраторыКОбработке(
		Параметры, Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Регистратор"), ПолноеИмяРегистра);
	
КонецПроцедуры

Процедура ОбработатьДанныеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	ПолноеИмяРегистра = "РегистрНакопления.МатериалыИРаботыВПроизводстве";
	
	Регистраторы = Новый Массив;
	Регистраторы.Добавить("Документ.ВводОстатков");
	//++ НЕ УТ
	Регистраторы.Добавить("Документ.ПередачаСырьяПереработчику");
	Регистраторы.Добавить("Документ.ВозвратСырьяОтПереработчика");
	Регистраторы.Добавить("Документ.ПоступлениеОтПереработчика");
	Регистраторы.Добавить("Документ.ОтчетПереработчика");
	//-- НЕ УТ
	
	Параметры.ОбработкаЗавершена = ОбновлениеИнформационнойБазыУТ.ПерезаписатьДвиженияИзОчереди(
		Регистраторы, ПолноеИмяРегистра, Параметры.Очередь);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
